app/Controllers/Praktikum.php

    public function profil()
    {

        $model = new MahasiswaModel();

        // Cek apakah NIM sudah ada agar tidak dobel
        if (!$model->find('32602300069')) {
            $model->insert([
                'nim' => '32602300069',
                'nama' => 'Agnan Toro',
                'prodi' => 'Teknik Informatika'
            ]);
        }

        // Ambil semua data dari tabel
        $data['mahasiswa'] = $model->findAll();
---
INSERT INTO `tb_mahasiswa` (`nim`, `nama`, `prodi`) VALUES ('32602300069', 'Agnan Toro', 'Teknik Informatika')
SELECT *
FROM `tb_mahasiswa`